/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   func_data.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yutsong <yutsong@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/17 13:19:55 by yutsong           #+#    #+#             */
/*   Updated: 2024/06/17 15:01:18 by yutsong          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "push_swap.h"

int	push()
{
	// 스택에 데이터 없으면 정지
	if ()
		return (0);
	// 스택에서 데이터 뽑기
}

int	swap()
{
	// 스택에 데이터 없으면 정지
	// 데이터 스왑하기
}

int	rotate()
{
	// 스택에 데이터 없으면 정지
	// 데이터 로테이션
}